#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=db93f8fe08bb3de4b031f283b5b81083af969896]
local_file.tfkey: Refreshing state... [id=f1a90f0e9ce2116650170789823cdfeea4b734d6]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_vpc.main: Refreshing state... [id=vpc-0bd724cd3f9919dd8]
data.aws_ami.java-ami: Reading...
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0d24a5e7e79422f11]
data.aws_ami.java-ami: Read complete after 0s [id=ami-0351f28b1922c33f1]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-000104fe5e96bbcb4]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0265976e3c07b530a]
aws_security_group.elb: Refreshing state... [id=sg-08ac19deafac43ebc]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-02b99e1c316132a7c]
aws_security_group.allow_http: Refreshing state... [id=sg-0bd1f6b4898fbcdcf]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-059492482790b581e]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0b19f5a73350d1181]
aws_security_group.allow_ssh: Refreshing state... [id=sg-09a68b15fdd190fa3]
aws_route_table.public_route_table: Refreshing state... [id=rtb-02b14e445e23211fb]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-06a6354c50711c873]
aws_instance.bastion-host: Refreshing state... [id=i-04cc9eeecd3717793]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20230126183808954200000001]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-086fa7a5f4c3bf358]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0a9b0946596c43ca8]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0585020f7b68b14b6]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-01aa2a1c0d2e346cd]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0961710775ce89466]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230126183926274100000004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ launch_configuration      = "terraform-20230126183808954200000001" -> (known after apply)
      ~ load_balancers            = [
          - "ELB",
        ]
        name                      = "Auto Scaling Group"
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.ec2_config must be replaced
+/- resource "aws_launch_configuration" "ec2_config" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:795939032463:launchConfiguration:507d4ba7-0152-4303-8eac-202b21ea87eb:launchConfigurationName/terraform-20230126183808954200000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20230126183808954200000001" -> (known after apply)
      ~ image_id                         = "ami-0529e23519231722b" -> "ami-0351f28b1922c33f1" # forces replacement
      ~ name                             = "terraform-20230126183808954200000001" -> (known after apply)
      ~ name_prefix                      = "terraform-" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*